Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchForRoofsoffit Property
 Roof Soffit sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchForRoofsoffit { get; }
Public Shared ReadOnly Property InvalidSketchForRoofsoffit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchForRoofsoffit {
	FailureDefinitionId^ get ();
}
static member InvalidSketchForRoofsoffit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace